app/controllers/epicenter_controller.rb

SELECT "users".* FROM "users"
---
def all_users
  @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def following
  @users = User.where(id: current_user.following)

SELECT "users".* FROM "users"
---
def followers
  @users = []

  User.all.each do |user|

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" IN (1, 2)
---
  def feed
  	@following_tweets = Tweet.where(user_id: current_user.following << current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show_user
  	@user = User.find(params[:id])

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def tag_tweets
    @tag = Tag.find(params[:id])

UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", "---\n- 1\n"], ["updated_at", "2018-04-04 22:53:35.102147"], ["id", 2]]
---
  def now_following
  	current_user.following.push(params[:id].to_i)

UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", nil], ["updated_at", "2018-04-09 22:49:23.575725"], ["id", 1]]
---
  def unfollow
  	current_user.following.delete(params[:id].to_i)
  	current_user.save