app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets"

  def create
    @tweet = Tweet.create(tweet_params)

    message_arr = @tweet.message.split




    message_arr.each_with_index do |word, index|
      if word[0] == '#'
        tag = Tag.find_or_create_by(phrase: word)
        TweetTag.create(tweet_id: @tweet.id, tag_id: tag.id)
        message_arr[index] = "<a href='/tag_tweets?id=#{tag.id}'>#{word}</a>"
    end
  end
    @tweet.update(message: message_arr.join(' '))
---
INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "asdfasfdsaasdfasfdsaasdfasfdsaasdfasfdsa"], ["user_id", 1], ["created_at", "2018-04-03 00:34:32.775065"], ["updated_at", "2018-04-03 00:34:32.775065"]]
INSERT INTO "tags" ("phrase", "created_at", "updated_at") VALUES (?, ?, ?)  [["phrase", "#code"], ["created_at", "2018-04-05 00:01:20.936473"], ["updated_at", "2018-04-05 00:01:20.936473"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."phrase" = ? LIMIT ?  [["phrase", "#code"], ["LIMIT", 1]]
INSERT INTO "tweet_tags" ("tweet_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tweet_id", 5], ["tag_id", 2], ["created_at", "2018-04-05 00:23:49.876067"], ["updated_at", "2018-04-05 00:23:49.876067"]]
UPDATE "tweets" SET "message" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["message", "i love to <a href='/tag_tweets?id=1'>#code</a>"], ["updated_at", "2018-04-05 00:01:20.986343"], ["id", 4]]

    def set_tweet
      @tweet = Tweet.find(params[:id])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]